
Detection logic:

Verify Windows Logon Exists--> View Relevant Fields & Count Logon Types ->Find Remote Desktop Logons -> Investigate Failed Remote Logons-> Look for Brute Force then Success--> See which users logon most --> see which systems recieve logins


EventCode – Identifies successful or failed authentication events.

Logon_Type – Determines how authentication occurred and was used to identify remote interactive logons (RDP).

Account_Name – Identifies the user account associated with the authentication event.

ComputerName – Identifies the system accessed during the remote connection.

_time – Provides a timeline of authentication activity for investigation purposes.


IMPORTANT SPLUNK COMMANDS:

index=* sourcetype=WinEventLog:Security EventCode=4624
| stats count by Logon_Type
(investigate which logon types exist in my environment, this baseline query)

index=* sourcetype=WinEventLog:Security EventCode=4625
| table _time Account_Name ComputerName Failure_Reason
(this is my faield authentication investigation)


index=* sourcetype=WinEventLog:Security EventCode=4624 Logon_Type=10
| table _time Account_Name ComputerName Logon_Type

(In my case, logon type 10 doesnt exist towards my device, but this would be the code to detect RDP access.)

index=* sourcetype=WinEventLog:Security EventCode=4624
| table _time Account_Name ComputerName Logon_Type
| sort -_time
(This here is my investigation query, designed to identify activity associated with ATT&CK technique Im monitoring, check if someone remotely authenticated to a system)
